Homework_Week1

In [1]:
#Question 1. Understanding docker first run

# docker run -it python:3.12.8 bash
# pip --version
# ANSWER: pip 24.3.1

In [2]:
# Question 2. Understanding Docker networking and docker-compose
# Answer: postgres:5432

In [3]:
import pandas as pd

In [4]:
url1 = "https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-10.csv.gz"
url2 = "https://github.com/DataTalksClub/nyc-tlc-data/releases/download/misc/taxi_zone_lookup.csv"

df1 = pd.read_csv(url1, compression='gzip')
df2 = pd.read_csv(url2)

C:\Users\kyana\AppData\Local\Temp\ipykernel_7692\3546475987.py:4: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df1 = pd.read_csv(url1, compression='gzip')

In [5]:
df1.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1.0,112,196,1.0,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2.0,1.0,0.0
1,1.0,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1.0,43,263,1.0,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2.0,1.0,0.0
2,1.0,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1.0,255,228,2.0,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2.0,1.0,0.0
3,1.0,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1.0,181,181,1.0,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2.0,1.0,0.0
4,2.0,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1.0,97,188,1.0,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1.0,1.0,0.0

In [6]:
df2.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476386 entries, 0 to 476385
Data columns (total 20 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               387007 non-null  float64
 1   lpep_pickup_datetime   476386 non-null  object
 2   lpep_dropoff_datetime  476386 non-null  object
 3   store_and_fwd_flag     387007 non-null  object
 4   RatecodeID             387007 non-null  float64
 5   PULocationID           476386 non-null  int64
 6   DOLocationID           476386 non-null  int64
 7   passenger_count        387007 non-null  float64
 8   trip_distance          476386 non-null  float64
 9   fare_amount            476386 non-null  float64
 10  extra                  476386 non-null  float64
 11  mta_tax                476386 non-null  float64
 12  tip_amount             476386 non-null  float64
 13  tolls_amount           476386 non-null  float64
 14  ehail_fee              0 non-null       float64
 15  improvement_surcharge  476386 non-null  float64
 16  total_amount           476386 non-null  float64
 17  payment_type           387007 non-null  float64
 18  trip_type              387005 non-null  float64
 19  congestion_surcharge   387007 non-null  float64
dtypes: float64(15), int64(2), object(3)
memory usage: 72.7+ MB

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       265 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB

In [9]:
df1.lpep_pickup_datetime = pd.to_datetime(df1.lpep_pickup_datetime)
df1.lpep_dropoff_datetime= pd.to_datetime(df1.lpep_dropoff_datetime)

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476386 entries, 0 to 476385
Data columns (total 20 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               387007 non-null  float64
 1   lpep_pickup_datetime   476386 non-null  datetime64[ns]
 2   lpep_dropoff_datetime  476386 non-null  datetime64[ns]
 3   store_and_fwd_flag     387007 non-null  object
 4   RatecodeID             387007 non-null  float64
 5   PULocationID           476386 non-null  int64
 6   DOLocationID           476386 non-null  int64
 7   passenger_count        387007 non-null  float64
 8   trip_distance          476386 non-null  float64
 9   fare_amount            476386 non-null  float64
 10  extra                  476386 non-null  float64
 11  mta_tax                476386 non-null  float64
 12  tip_amount             476386 non-null  float64
 13  tolls_amount           476386 non-null  float64
 14  ehail_fee              0 non-null       float64
 15  improvement_surcharge  476386 non-null  float64
 16  total_amount           476386 non-null  float64
 17  payment_type           387007 non-null  float64
 18  trip_type              387005 non-null  float64
 19  congestion_surcharge   387007 non-null  float64
dtypes: datetime64[ns](2), float64(15), int64(2), object(1)
memory usage: 72.7+ MB

In [11]:
from sqlalchemy import create_engine
df1_engine = create_engine('postgresql://postgres:postgres@localhost:5433/green_tripdata_2019-10')
df2_engine = create_engine('postgresql://postgres:postgres@localhost:5433/timezones')

In [12]:
df1.to_sql('green_tripdata_2019_10', con=df1_engine, if_exists='replace')

386

In [13]:
df2.to_sql('timezones', con=df2_engine, if_exists='replace')

265

In [17]:
# Question 3. Trip Segmentation Count

In [16]:
"""
SQL Querys: /*
-- Up to 1 mile | answer: 104802
select count(*) from green_tripdata_2019_10
where 1=1
	AND lpep_pickup_datetime >= '2019-10-01'
	AND lpep_dropoff_datetime < '2019-11-01'
	AND trip_distance <=1;


-- In between 1 (exclusive) and 3 miles (inclusive) | answer: 198924
select count(*) from green_tripdata_2019_10
where 1=1
	AND lpep_pickup_datetime >= '2019-10-01'
	AND lpep_dropoff_datetime < '2019-11-01'
	AND trip_distance > 1
	AND trip_distance <= 3;


-- In between 3 (exclusive) and 7 miles (inclusive) | answer: 109603
select count(*) from green_tripdata_2019_10
where 1=1
	AND lpep_pickup_datetime >= '2019-10-01'
	AND lpep_dropoff_datetime < '2019-11-01'
	AND trip_distance > 3
	AND trip_distance <= 7;

-- In between 7 (exclusive) and 10 miles (inclusive) | answer: 27678
select count(*) from green_tripdata_2019_10
where 1=1
	AND lpep_pickup_datetime >= '2019-10-01'
	AND lpep_dropoff_datetime < '2019-11-01'
	AND trip_distance > 7
	AND trip_distance <= 10;


-- Over 10 miles| answer: 35189
select count(*) from green_tripdata_2019_10
where 1=1
	AND lpep_pickup_datetime >= '2019-10-01'
	AND lpep_dropoff_datetime < '2019-11-01'
	AND trip_distance > 10;

"""

"\nSQL Querys: /*\n-- Up to 1 mile | answer: 104802\nselect count(*) from green_tripdata_2019_10\nwhere 1=1\n\tAND lpep_pickup_datetime >= '2019-10-01'\n\tAND lpep_dropoff_datetime < '2019-11-01'\n\tAND trip_distance <=1;\n\n\n-- In between 1 (exclusive) and 3 miles (inclusive) | answer: 198924\nselect count(*) from green_tripdata_2019_10\nwhere 1=1\n\tAND lpep_pickup_datetime >= '2019-10-01'\n\tAND lpep_dropoff_datetime < '2019-11-01'\n\tAND trip_distance > 1\n\tAND trip_distance <= 3;\n\n\n-- In between 3 (exclusive) and 7 miles (inclusive) | answer: 109603\nselect count(*) from green_tripdata_2019_10\nwhere 1=1\n\tAND lpep_pickup_datetime >= '2019-10-01'\n\tAND lpep_dropoff_datetime < '2019-11-01'\n\tAND trip_distance > 3\n\tAND trip_distance <= 7;\n\n-- In between 7 (exclusive) and 10 miles (inclusive) | answer: 27678\nselect count(*) from green_tripdata_2019_10\nwhere 1=1\n\tAND lpep_pickup_datetime >= '2019-10-01'\n\tAND lpep_dropoff_datetime < '2019-11-01'\n\tAND trip_distance > 7\n\tAND trip_distance <= 10;\n\n\n-- In between 7 (exclusive) and 10 miles (inclusive) | answer: 35189\nselect count(*) from green_tripdata_2019_10\nwhere 1=1\n\tAND lpep_pickup_datetime >= '2019-10-01'\n\tAND lpep_dropoff_datetime < '2019-11-01'\n\tAND trip_distance > 10;\n\n"

In [19]:
# Question 4. Longest trip for each day | 2019-10-31
""""
select * from green_tripdata_2019_10
order by trip_distance desc
limit 1;
"""

'"\nselect * from green_tripdata_2019_10\norder by trip_distance desc\nlimit 1;\n'

In [20]:
# Question 5. Three biggest pickup zones
"""
WITH temp AS (
  SELECT *
  FROM green_tripdata_2019_10 AS g
  JOIN dblink('dbname=timezones user=postgres password=postgres',
              'SELECT "LocationID", "Borough", "Zone" FROM public.timezones')
  AS t("LocationID" int, "Borough" text, "Zone" text)
  ON g."PULocationID" = t."LocationID"
)

SELECT "PULocationID", "Zone", SUM(total_amount) AS total_amount
FROM temp
WHERE DATE(lpep_pickup_datetime) = '2019-10-18'
GROUP BY "PULocationID", "Zone"
HAVING SUM(total_amount) > 13000
ORDER BY total_amount DESC;
"""

'\nselect "PULocationID", sum(total_amount) as total_amount from green_tripdata_2019_10\nwhere date(lpep_pickup_datetime) = \'2019-10-18\'\ngroup by "PULocationID"\norder by 2 desc\nlimit 5;\n'